# Triangulate Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PlanarFace..::..Triangulate Method
PlanarFace Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Triangulate()()()() | Returns a triangular mesh approximation to the face. (Inherited from Face.) |
| Triangulate(Double) | Returns a triangular mesh approximation to the face. (Inherited from Face.) |

# See Also
PlanarFace Class
PlanarFace Members
Autodesk.Revit.DB Namespace